Repository: 84000/data-translation-memory
Catalog: toh263-v3.tmx
Source language: bo
Languages: en

source: སྨོན་ལམ་གྱི་ཁྱད་པར་གྱིས་སེམས་ཅན་རྣམས་ལྟ་བར་སོང་བ་ཐམས་ཅད་ལས་ཡོངས་སུ་དགྲོལ་གྱི། གཞན་གང་གི་མཐུས་ཀྱང་སེམས་ཅན་རྣམས་ལྟ་བར་སོང་བ་ཐམས་ཅད་ལས་ཡོངས་སུ་གྲོལ་བར་མི་འགྱུར་རོ། །
en: Your aspirations will liberate beings from all manner of paths to wrong views, and no other power can liberate beings from all manner of paths to wrong views.

source: རིགས་ཀྱི་བུ་བྱང་ཆུབ་ཀྱི་ཕྱིར་ལུང་བསྟན་པ་འདི་སུ་ཞིག་གི་དུས་གསུམ་གྱི་གཟུགས་ཀྱི་ཕུང་པོ་ནས་རྣམ་པར་ཤེས་པའི་ཕུང་པོའི་བར་དུ་ཡིན་ནམ།
en: Noble son, to whose aggregates of form up to consciousness in the three times is this prophecy of awakening related?

source: འོན་ཏེ་དུས་གསུམ་གྱི་བདེ་བ་དང་། སྡུག་བསྔལ་དང་། བདེ་བ་ཡང་མེད་སྡུག་བསྔལ་ཡང་མེད་པ་ཚོར་བའི་སྐྱེ་མཆེད་དྲུག་པོ་འདི་དག་གི་ཡིན་ནམ།
en: To whose six sense fields associated with feelings of the three times, which are pleasant, unpleasant, or neither pleasant nor unpleasant, is it related?

source: འོན་ཏེ་ཚོར་བ་མེད་པ་ཡིན་ནམ།
en: To whose absence of feeling is it related?

source: བྱང་ཆུབ་ཀྱི་ཕྱིར་ལུང་བསྟན་པ་ཞེས་བྱ་བ་འདི་སུ་ཞིག་གི་ཡིན། གསོལ་པ།
en: Whose prophecy of awakening is this?”

source: བཙུན་པ་བཅོམ་ལྡན་འདས་འདི་ལྟ་སྟེ། བདག་ལུང་བསྟན་པར་གསོལ་བའམ་བདག་ལུང་སྟོན་པའམ། བདག་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ལུང་བསྟན་པ་དེ་མ་མཆིས་སོ། །
en: “Respected Blessed One, my request for this prophecy, the prophecy I made, and the prophecy of my unsurpassed and perfect awakening do not exist.

source: དེ་ཅིའི་སླད་དུ་ཞེ་ན། ཇི་ལྟར་ནམ་མཁའ་འདི་རྫས་མ་མཆིས། དངོས་པོ་མ་མཆིས།
en: Why do I say this?

source: རང་བཞིན་མ་མཆིས། ཅུང་ཟད་ཀྱང་མ་མཆིས། ཡི་གེ་མ་མཆིས། ཐོབ་པ་མ་མཆིས། བརྗོད་དུ་མ་མཆིས་པ་དེ་བཞིན་དུ་ཆོས་འདི་དག་ཀྱང་རྫས་མ་མཆིས་ཤིང་དངོས་པོ་མ་མཆིས་པ་ནས། བརྗོད་དུ་མ་མཆིས་ཤིང་མ་སྐྱེས་པའི་བར་དུའོ། །
en: Just as space is immaterial, insubstantial, without intrinsic nature, utterly nonexistent, wordless, without attainment, and inexpressible, those phenomena are also everything from immaterial and insubstantial to inexpressible and unborn.

source: བཙུན་པ་བཅོམ་ལྡན་འདས་དུས་གསུམ་གྱི་གཟུགས་འབྱུང་བ་མ་མཆིས་ཏེ་ལྟ་བའི་མཚན་ཉིད་དང་ཉེ་བར་བྲལ་བ་ནས་རྣམ་པར་ཤེས་པའི་བར་དུ་ཡང་མ་སྐྱེས་པའོ། །
en: Respected Blessed One, everything from form to consciousness does not arise across the three times. They are free from visible characteristics and are unborn.

source: བཙུན་པ་བཅོམ་ལྡན་འདས་དུས་གསུམ་གྱི་མིག་འབྱུང་བ་མ་མཆིས་ཤིང་ལྟ་བའི་མཚན་ཉིད་དང་ཉེ་བར་བྲལ་བ་ནས་དུས་གསུམ་གྱི་ནང་གི་ཡིད་ཀྱི་བར་དང་།
en: Respected Blessed One, everything from the eyes to the internal mental faculty of the three times does not arise and is free from visible characteristics.

source: བདེ་བ་དང་། སྡུག་བསྔལ་བ་དང་། བདེ་བ་ཡང་མ་མཆིས་སྡུག་བསྔལ་བ་ཡང་མ་མཆིས་པའི་ཚོར་བ་ཡང་མ་སྐྱེས་པ་ནས་ལྟ་བའི་མཚན་ཉིད་དང་བྲལ་བའི་བར་དུའོ། །
en: Feelings that are pleasant, unpleasant, and neither pleasant nor unpleasant are everything from unborn to free from visible characteristics.

source: བཙུན་པ་བཅོམ་ལྡན་འདས་བདག་གིས་ནི་དུས་གསུམ་གྱི་གཟུགས་ཀྱི་ཡང་དག་པའི་མཐའ་དང་། ཆོས་ཉིད་ལ་སྐྱེ་བའམ། གནས་པའམ། འཇིག་པ་མི་དམིགས་སོ། །
en: Respected Blessed One, I do not apprehend an ultimate nature of forms related to the three times, or arising, abiding, and disintegrating in the nature of reality.

source: ཆོས་ཀྱི་དབྱིངས་ལ་ཡང་གནས་པར་མི་དམིགས་ཏེ།
en: I do not apprehend anything that dwells in the realm of phenomena.

source: མིང་དང་གཟུགས་ཀྱང་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་ངོ་། །
en: I do not see name and form.

source: བརྡར་བཏགས་པ་ཙམ་དུ་ཡང་གཟུགས་ཀྱི་མཚན་ཉིད་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་སྟེ།
en: I cannot see the characteristics of form, which are mere labels.

source: དེ་བཞིན་དུ་ཚོར་བ་དང་། འདུ་ཤེས་དང་། འདུ་བྱེད་རྣམས་དང་།
en: The same goes for feelings, perceptions, and formations.

source: བཙུན་པ་བཅོམ་ལྡན་འདས་བདག་གིས་ནི་དུས་གསུམ་གྱི་རྣམ་པར་ཤེས་པའི་ཡང་དག་པའི་མཐའི་བར་ལ་ཡང་བརྡར་བཏགས་པ་ཙམ་དུ་ཡང་རྣམ་པར་ཤེས་པའི་མཚན་ཉིད་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་སྟེ། །
en: Respected Blessed One, I do not see the characteristics of consciousness, which are mere labels, in the ultimate reality of the consciousnesses of the three times.

source: བཅོམ་ལྡན་འདས་བདག་གིས་ནི་དུས་གསུམ་གྱི་མིག་གི་ཡང་དག་པའི་མཐའ་ནས་བརྡ་ཙམ་དུ་བཏགས་པའི་མིག་གི་མཚན་ཉིད་ནས་དུས་གསུམ་གྱི་ནང་གི་ཡིད་ཀྱི་འདུས་ཏེ་རེག་པ་བདེ་བ་དང་། སྡུག་བསྔལ་དང་། བདེ་བ་ཡང་མ་མཆིས། སྡུག་བསྔལ་ཡང་མ་མཆིས་པའི་བར་དུ་ཡང་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་ངོ་། །
en: Blessed One, I do not see the ultimate reality of the eye related to the three times; the characteristics of the eye, which are mere verbal designations; the collection of the internal mental faculty related to the three times; or contact that is pleasant, unpleasant, or neither pleasant nor unpleasant.

source: བཙུན་པ་བཅོམ་ལྡན་འདས་བདག་གིས་ནི་ཡང་དག་པའི་མཐའ་དང་། ཆོས་ཉིད་དང་། ཆོས་སྐྱོན་མེད་པ་ཉིད་ཀྱི་སྐྱེ་བ་དང་། གནས་པ་དང་། འགོག་པ་མི་དམིགས་སོ། །
en: Respected Blessed One, I do not apprehend arising, abiding, and disintegrating as being related to ultimate reality, the true nature of phenomena, or the faultlessness of phenomena.

source: ཡིད་དང་ཆོས་ཀྱི་ཁམས་ཀྱང་མི་དམིགས་སོ། །
en: I do not apprehend the elements related to mind and mental phenomena.

source: བདག་གིས་ནི་ཡིད་རྣམ་པར་གནས་པའི་མཚན་ཉིད་ཀྱང་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་ངོ་། །
en: I do not see the abiding characteristics of the mind.

source: ཆོས་ཐམས་ཅད་ནི་བྲག་ཅ་ལྟ་བུ་སྟེ།
en: Because all phenomena are like echoes.

source: ནམ་མཁའ་ལ་བརྟག་པའི་མཚན་ཉིད་ལྟ་བུ་འོང་བ་མེད་ཅིང་འགྲོ་བ་མེད་པ་གང་ལ་གང་གིས་ཀྱང་མ་བཟུང་བའོ། །
en: Like characteristics superimposed on space, they are without coming and going, and they are not apprehended in any way.

source: ཆོས་ཐམས་ཅད་ནི་མིག་ཡོར་ལྟ་བུ། སྨིག་རྒྱུ་ལྟ་བུ། རྨི་ལམ་ལྟ་བུ། ཆུ་ཟླ་ལྟ་བུ་སྟེ།
en: All phenomena are like optical illusions, mirages, dreams, and reflections of the moon in water.

source: བཙུན་པ་བཅོམ་ལྡན་འདས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་ཏིང་ངེ་འཛིན་སྤངས་པའི་མཚན་ཉིད་བཟུང་བ་མ་མཆིས་པ་ཞེས་བགྱི་བ་ཞིག་མཆིས་ཏེ། ཉན་ཐོས་དང་། རང་སངས་རྒྱས་ཐམས་ཅད་དང་ཐུན་མོང་བ་མ་ལགས་སོ། །
en: “Respected Blessed One, bodhisattva great beings have an absorption called the nonexistence of apprehended objects and freedom from characteristics, which is not shared with any of the hearers or solitary buddhas.

source: དེ་ལ་གཟུགས་ཀྱི་མཚན་ཉིད་དང་བྲལ་ཞིང་ཡོངས་སུ་གཟུང་དུ་མ་མཆིས་པའི་ཏིང་ངེ་འཛིན་གང་ཞེ་ན། འདི་ལྟ་སྟེ། ནང་སྟོང་པ་ཉིད་དང་། ཕྱི་སྟོང་པ་ཉིད་དང་།
en: What is this absorption that is free from the characteristics of forms and lacks apprehended objects?

source: ཕྱི་ནང་སྟོང་པ་ཉིད་དང་། སྟོང་པ་ཉིད་སྟོང་པ་ཉིད་དང་། ཆེན་པོ་སྟོང་པ་ཉིད་དང་། དོན་དམ་པ་སྟོང་པ་ཉིད་དང་། འདུས་བྱས་སྟོང་པ་ཉིད་དང་། འདུས་མ་བྱས་སྟོང་པ་ཉིད་དང་། རབ་ཏུ་སྟོང་པ་ཉིད་དང་། ཐོག་མ་དང་ཐ་མ་མེད་པ་སྟོང་པ་ཉིད་དང་། མི་འགྱུར་བ་སྟོང་པ་ཉིད་དང་། རང་བཞིན་སྟོང་པ་ཉིད་དང་། རང་གི་མཚན་ཉིད་སྟོང་པ་ཉིད་དང་། ཆོས་ཐམས་ཅད་སྟོང་པ་ཉིད་དང་། མི་དམིགས་པ་སྟོང་པ་ཉིད་དང་། དངོས་པོ་མེད་པ་སྟོང་པ་ཉིད་དང་། ངོ་བོ་ཉིད་སྟོང་པ་ཉིད་དང་། དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་སྟོང་པ་ཉིད་དག་བཟུང་བ་དེ་ནི་མཚན་ཉིད་དང་བྲལ་བ་ཡོངས་སུ་བཟུང་བ་མ་མཆིས་པ་ཞེས་བགྱི་བའི་ཏིང་ངེ་འཛིན་ཏེ། ཉན་ཐོས་དང་། རང་སངས་རྒྱས་ཐམས་ཅད་དང་ཐུན་མོང་བ་མ་ལགས་སོ། །བཙུན་པ་བཅོམ་ལྡན་འདས་དེ་ནི་རྣམ་གྲངས་འདིས་ཀྱང་དེ་སྐད་བརྗོད་པར་བགྱི་སྟེ། འདི་ལྟ་སྟེ།
en: Apprehending the emptiness of the inner, the emptiness of the outer, the emptiness of both the inner and the outer, the emptiness of emptiness, great emptiness, the emptiness of the ultimate truth, the emptiness of conditioned phenomena, the emptiness of unconditioned phenomena, supreme emptiness, the emptiness that is devoid of beginning and end, immutable emptiness, the emptiness of intrinsic nature, the emptiness of inherent characteristics, the emptiness of all phenomena, the emptiness of nonapprehension, the emptiness of insubstantiality, the emptiness of essential nature, and the emptiness of insubstantial essential nature is the absorption known as freedom from characteristics and absence of an apprehended object, which is not shared with any of the hearers or solitary buddhas.

source: དེ་ནི་མ་མཆིས་པའི་ཚིག་བླ་དགས་སོ། །འདི་ལྟ་སྟེ། བདག་ལ་ནི་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ལུང་བསྟན་ཏོ། །ལུང་སྟོན་པར་འགྱུར་རོ། །ལུང་བསྟན་ཏོ་སྙམ་དུ་མི་སེམས་སོ། །
en: Respected Blessed One, it should be explained in the following way: It is a verbal designation for what does not exist in that I do not think, ‘That prophecy of unsurpassed, perfect awakening was directed at me, the prophecy will come to pass, or the prophecy has come to pass.’

source: བདག་ནི་ལུང་བསྟན་པ་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་།
en: Because I do not see any prophecy.

source: བརྗོད་པ་དང་ལུང་བསྟན་པ་དང་འཁོར་བ་ཡང་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་།
en: I do not see any expression, prophecy, or saṃsāra.

source: མྱ་ངན་ལས་འདའ་བ་དང་། རྣལ་འབྱོར་དང་། རྣལ་འབྱོར་མ་ལགས་པ་དང་། ལམ་དང་། ལམ་མ་ལགས་པ་ཡང་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་ངོ་། །འདི་ལྟ་སྟེ།
en: I do not see nirvāṇa, yoga practice, what is not yoga practice, the path, or what is not the path.

source: དཔེར་ན་དེ་བཞིན་ཉིད་ཀྱི་ལམ་མ་མཆིས་ཤིང་ཕྱིན་ཅི་མ་ལོག་པ་དེ་བཞིན་ཉིད་དང་། ཆོས་ཀྱི་དབྱིངས་དང་། ཆོས་ཉིད་དང་། ཆོས་སྐྱོན་མེད་པ་ཉིད་ཀྱི་ལམ་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་བ་དེ་བཞིན་དུ་གཟུགས་སུ་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་བ་ནས། རྣམ་པར་ཤེས་པའི་བར་དུ་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་ངོ་། །
en: Just as the path of suchness is nonexistent and I do not see the path of unmistaken suchness, the realm of phenomena, the true nature of phenomena, or the faultlessness of phenomena, so too I do not see anything from form to consciousness.

source: མིག་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་བ་ནས། ཡིད་ཀྱི་རྣམ་པར་ཤེས་པའི་བར་གྱི་ལམ་ཡང་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་ངོ་། །
en: I do not see anything from the eyes to mental consciousness.

source: ལུང་བསྟན་པ་བརྗོད་པ་འདིའི་སྐབས་དང་གོ་སྐབས་ཀྱང་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་ངོ་། །
en: I do not see a specific occasion or opportunity wherein this prophecy was proclaimed.

source: གང་གཟུགས་ཀྱི་ལུང་བསྟན་པ་ནས། རྣམ་པར་ཤེས་པའི་བར་དང་། མིག་ནས་ཡིད་ཀྱི་བར་གྱི་ལུང་བསྟན་པ་དང་། གང་བྱང་ཆུབ་ཏུ་ལུང་བསྟན་པ་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་ངོ་། །
en: I do not see this prophecy in relation to anything from form to consciousness, or in relation to anything from the eyes to the mind, or as a prophecy of someone’s awakening.”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བྱང་ཆུབ་སེམས་དཔའ་ཤིན་ཏུ་བསྟན་པ་འདི་བཤད་པ་ན། ཀུན་ཏུ་རྒྱུ་ཤིན་ཏུ་རྣམ་པར་ཕྱེ་བའི་སས་ཀྱང་དེ་ཡང་ཡང་དག་པར་རྗེས་སུ་མ་མཐོང་ནས། ཡང་དག་པར་སྤྱོད་པའི་ཚུལ་ནམ་མཁའི་མདོག་གིས་འདུལ་བའི་བཟོད་པ་རབ་ཏུ་ཐོབ་པར་གྱུར་ཏོ། །
en: As this teaching of the bodhisattvas was being delivered by the Blessed One, the parivrājaka Allotted Ground saw him and attained the acceptance that tames beings with the sky-colored method of perfect conduct.

source: སེམས་ཅན་གཞན་མུ་སྟེགས་ཅན་ང་རྒྱལ་བཅོམ་པ་སྟོང་ཕྲག་བཅུ་གསུམ་པོ་དེ་དག་ནི་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་ནས་ཕྱིར་མི་ལྡོག་པའི་ས་རབ་ཏུ་ཐོབ་པར་གྱུར་ཏོ། །
en: Thirteen thousand non-Buddhists who had conquered their pride gave rise to the mind set on unsurpassed and perfect awakening and reached the level of nonregression.

source: ཡང་དག་པར་སྤྱོད་པའི་ཚུལ་ནམ་མཁའི་མདོག་གིས་འདུལ་བའི་བཟོད་པ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ། །ལེའུ་བཅུ་གཅིག་པའོ།། །།
en: This was the eleventh chapter of the Great Vehicle sūtra entitled “The Acceptance That Tames Beings with the Sky-Colored Method of Perfect Conduct.”

source: དེ་ནས་བཅོམ་ལྡན་འདས་སྒྲ་ཐམས་ཅད་ལ་འཇུག་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་ལ་སྙོམས་པར་ཞུགས་སོ། །
en: Conclusion The Blessed One then entered the absorption known as entering all sounds.

source: ཏིང་ངེ་འཛིན་དེས་སེམས་ཅན་གྱི་སྐྱེ་གནས་སྟོང་ཕྲག་བརྒྱད་ཅུ་རྩ་བཞི་པོ་དེ་དག་གི་སྒྲ་བརྗོད་པའི་ཚིག་སྟོང་ཕྲག་བརྒྱད་ཅུ་རྩ་བཞི་པོ་ཏིང་ངེ་འཛིན་དེས་སྐྱེ་གནས་དང་སྒྲ་དབྱངས་ཀྱི་ཚིག་བརྗོད་པ་ཐམས་ཅད་ཚིམ་པར་བྱེད་དོ། །
en: Through that absorption, he brought satisfaction to all the beings living in the different places of birth by using that absorption to speak in the 84,000 languages and dialects of those 84,000 places of birth.

source: དེ་ལ་བཅོམ་ལྡན་འདས་ཀྱིས་ཡི་གེ་དང་སྨྲས་པ་ཉོན་ཅིག །
en: The Blessed One said, “Listen to these syllables and expressions!

source: གྲོགས་པོ་དག་ཉོན་ཅིག །
en: Listen, my friends!

source: གྲོགས་པོ་དག་ལྷ་དང་མིར་སྐྱེ་བ་ཐོབ་པར་འགྱུར་བ་དང་། ལམ་གང་གིས་ཉན་ཐོས་ཀྱི་ཐེག་པ་རྙེད་དེ་སྡུག་བསྔལ་ཐམས་ཅད་ཟད་པར་འགྱུར་བ་དང་། རང་སངས་རྒྱས་ཀྱི་ཐེག་པ་རྙེད་པ་དང་། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་རྙེད་པར་འགྱུར་བ་བདེ་བ་དང་ཞི་བའི་ལམ་སྟོན་ཅིག །
en: My friends, teach the path of happiness and peace that leads to rebirth as a god or a human, to the attainment of the vehicle of the hearers through which all forms of suffering will be extinguished, to the attainment of the vehicle of the solitary buddhas, and to the attainment of unsurpassed and perfect awakening!”

source: བཅོམ་ལྡན་འདས་ཀྱིས་སྒྲ་དབྱངས་བརྗོད་པ་དེ་ཕྱོགས་བཅུ་ཀུན་ཏུ་སྐད་དང་ཚིག་གཅིག་བརྗོད་པས་ཡི་གེ་དང་སྒྲ་དབྱངས་བརྗོད་པ་སྟོང་ཕྲག་བརྒྱད་ཅུ་རྩ་བཞི་བརྗོད་པའི་གྲངས་སུ་འགྲོའོ། །
en: As the Blessed One uttered those melodious words throughout the ten directions in a single statement, they transformed into 84,000 different languages and tones.

source: ཡི་གེ་དང་སྒྲ་དབྱངས་བརྗོད་པ་དེས་སེམས་ཅན་ཐམས་ཅད་རང་རང་གི་ཚིག་ཁོང་དུ་ཆུད་པར་འགྱུར་རོ། །
en: Through the expression of those languages and dialects, all beings understood that statement in their own words.

source: ཕྱོགས་བཅུ་ཐམས་ཅད་ཀྱི་སངས་རྒྱས་ཀྱི་ཞིང་སྟོང་པ་རྙོག་པ་ལྔ་དང་ལྡན་པ་ཆུ་བོ་གང་གཱའི་བྱེ་མ་སྙེད་སྒྲ་དབྱངས་ཀྱིས་རྒྱས་པར་བྱེད་དོ། །
en: Those melodious words spread throughout the empty buddha realms of the ten directions inundated with the five impurities that were as numerous as all the grains of sand in the Ganges.

source: ཆུ་བོ་གང་གཱའི་བྱེ་མ་སྙེད་ཀྱི་སངས་རྒྱས་ཀྱི་ཞིང་སྟོང་པ་རྙོག་པ་ལྔ་དང་ལྡན་པ་དེའི་སེམས་ཅན་ངན་པར་སོང་བ་རྣམས་ཀྱི་རྣ་ལམ་དུ་ཡང་གྲག་གོ། །
en: They even resounded in the ears of the beings that had been born in the lower realms in those empty buddha realms of the ten directions inundated with the five impurities that were as numerous as all the grains of sand in the Ganges.

source: དེ་ནས་སེམས་ཅན་དེ་དག་རང་རང་གི་ཚིག་ཀུན་ཏུ་ཤེས་ནས་འདི་སྙམ་དུ་སེམས་ཏེ། འདི་ལྟར་ཡིད་དུ་འོང་བ་འདི་ལྟར་སྙན་པ། འདི་ལྟར་དགའ་བར་འགྱུར་བ་འདི་སུའི་ཚིག་བདག་ཅག་ལ་ཞི་བ་དང་བདེ་བའི་ལམ་སྟོན་པའི་སེམས་ཅན་གྱི་སྙིང་པོ་འདི་སུ་ཞིག །
en: Those beings understood this statement in their own words, and thought, “Who is this most sublime being who teaches us the path of peace and happiness with such beautiful, pleasant, and delightful words?

source: ལམ་གང་བསྟན་པས་ན་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཀྱི་བར་དུ་འཐོབ།
en: The path that he has taught will lead to unsurpassed and perfect awakening.

source: ཉན་ཐོས་ཀྱིས་ནི་ཅི་འདྲ་བ་ཞིག །
en: What is it like at the level of a hearer?

source: རང་སངས་རྒྱས་ཀྱིསའང་ཅི་འདྲ་བ་ཞིག །
en: What is it like at the level of a solitary buddha?

source: བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཀྱིསའང་ཅི་འདྲ་བ་ཞིག །
en: What is it like at the level of unsurpassed and perfect awakening?

source: ལམ་གང་ཐོབ་ན་བདག་ཅག་ལུས་ཀྱི་བདེ་བའི་ཚོར་བ་ཐམས་ཅད་བྱང་ཞིང་སྡུག་བསྔལ་ཐམས་ཅད་བྱང་སྟེ། ལུས་ཀྱི་གཡེང་བ་ཐམས་ཅད་སྲབ་པར་གྱུར། དེ་བས་ན་བདག་ཅག་གིས་བསྟི་སྟང་དུ་བྱས་ཏེ་མཉན་པར་བྱ་སྙམ་མོ། །
en: If we attain such a path, all our pleasant physical sensations and all our suffering will be purified, and all physical distractions will diminish, so we should show our respect and listen!”

source: བཅོམ་ལྡན་འདས་ཀྱིས་ཡང་བཀའ་སྩལ་པ། གྲོགས་པོ་དག་བཅུ་པོ་འདི་དག་ནི་དགེ་བའི་ལས་ཀྱི་ལམ་སྟེ།
en: The Blessed One said, “My friends, these ten are the path of virtuous actions.

source: དེས་ལྷ་དང་མིར་སྐྱེ་བ་རབ་ཏུ་འཐོབ། སྡུག་བསྔལ་ཐམས་ཅད་ཟད་པར་འགྱུར་བ་ཉན་ཐོས་ཀྱི་ཐེག་པ་ཡང་འཐོབ། སྡུག་བསྔལ་ཐམས་ཅད་ཟད་པར་འགྱུར་བ་འཐོབ་བོ། །
en: Through it you attain rebirth among gods and humans, you attain the vehicle of the hearers that leads to the exhaustion of all forms of suffering, and all your suffering will be extinguished.

source: དགེ་བའི་ལས་ཀྱི་ལམ་དེས་སེམས་ཅན་ཐམས་ཅད་ཀྱི་མཆོག་དམ་པ་ཁྱད་པར་ཅན་ཕུལ།
en: Through this path of virtuous actions, you will become the most sacred and eminent of all beings.

source: བྱམས་པ་ཆེན་པོ། སྙིང་རྗེ་ཆེན་པོ་ཐམས་ཅད་མཁྱེན་པའི་ཡེ་ཤེས་ཆེན་པོ་འཐོབ་པར་འགྱུར་རོ། །
en: You will develop great love, great compassion, and the great wisdom of an omniscient one.

source: སེམས་ཅན་ཐམས་ཅད་ལ་སྙིང་བརྩེ་ཞིང་ཕན་པར་བྱེད་པར་འགྱུར་རོ། །
en: You will feel affection toward all beings and work for their benefit.

source: དེ་ལ་དགེ་བའི་ལས་ཀྱི་ལམ་བཅུ་པོ་གང་ཞེ་ན།
en: What is this path of the ten virtuous actions?

source: དགེ་བའི་ལས་ཀྱི་ལམ་གང་དང་ལྡན་ན་སེམས་ཅན་རྣམས་མྱུར་དུ་ལྷ་དང་མིར་སྐྱེ་བ་འཐོབ་པ་ནས། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཀྱི་བར་དུ་འཐོབ་པར་འགྱུར་བ་སྟེ།
en: Beings who follow the path of virtuous actions will quickly attain everything from rebirth among gods and humans to unsurpassed and perfect awakening.

source: དེ་ལ་གྲོགས་པོ་དག་ལྷ་དང་མི་རྙེད་ནས་དགེ་བའི་ལས་ཀྱི་ལམ་ལ་བརྩོན་པར་བྱའོ། །
en: My friends, after being born among god and humans, you should exert yourselves in the path of virtuous actions.

source: སྦྱིན་པ་སྦྱིན་ནོ། །ཚུལ་ཁྲིམས་སྲུང་ངོ་། །འདུ་ཤེས་བཅུ་བསྒོམ་པར་བྱའོ། །
en: You should practice generosity, maintain discipline, and cultivate the ten perceptions.

source: བཅུ་གང་ཞེ་ན། འདི་ལྟ་སྟེ།
en: What are those ten perceptions?

source: རྣམ་པར་བམ་པར་འདུ་ཤེས་བསྒོམ་པར་བྱའོ། །
en: You should cultivate the perception of a decomposing corpse.

source: གང་གིས་རྒྱུན་དུ་ཞུགས་པའི་འབྲས་བུ་ནས། དགྲ་བཅོམ་པའི་འབྲས་བུའི་བར་དུ་ཐོབ་ཅིང་སྡུག་བསྔལ་ཐམས་ཅད་ཟད་པར་འགྱུར་བ་དང་། རྣམ་པར་རྣགས་པར་འདུ་ཤེས་པ་དང་། རྣམ་པར་སྔོས་པར་འདུ་ཤེས་པ་དང་། རྣམ་པར་དམར་བར་འདུ་ཤེས་པ་དང་། འབུས་གང་བར་འདུ་ཤེས་པ་དང་།
en: That will lead to everything from the result of a stream enterer to the result of a worthy one, and all your suffering will be extinguished.

source: རྣམ་པར་ཟོས་པར་འདུ་ཤེས་པ་དང་། རྣམ་པར་འཐོར་བར་འདུ་ཤེས་པ་དང་། ཀེང་རུས་སུ་འདུ་ཤེས་པ་དང་། རྣམ་པར་ཚིག་པར་འདུ་ཤེས་པ་དང་། འཆི་བར་འདུ་ཤེས་པ་བསྒོམ་པར་བྱའོ། །
en: You should also cultivate the perception of a putrefying corpse, the perception of a bluish corpse, the perception of a bloody corpse, the perception of a corpse covered by maggots, the perception of a devoured corpse, the perception of a scattered corpse, the perception of a skeleton, the perception of a burned corpse, and the perception of someone dying.

source: གང་གིས་རྒྱུན་ཏུ་ཞུགས་པའི་འབྲས་བུ་ནས། དགྲ་བཅོམ་པའི་འབྲས་བུའི་བར་དུ་ཐོབ་ཅིང་སྡུག་བསྔལ་ཐམས་ཅད་ཟད་པ་ཐོབ་སྟེ།
en: Through those perceptions, you will attain everything from the fruition of the stream enterers to the fruition of the worthy ones, and all your sufferings will be extinguished.

source: མིར་གྱུར་པ་ཐོབ་ནས་ཀྱང་ཡང་གང་གིས་རང་སངས་རྒྱས་ཀྱི་ས་རྗེས་སུ་འཐོབ་པར་འགྱུར་བའི་འདུ་ཤེས་བཅུ་གཉིས་བསྒོམ་པར་བྱ་སྟེ།
en: “Once you are born among humans, you should cultivate the twelve perceptions that lead to the attainment of the level of the solitary buddhas.

source: བཅུ་གཉིས་གང་ཞེ་ན། བསམ་གཏན་བཞི་དང་།
en: What are those twelve perceptions?

source: ཚད་མེད་པ་བཞི་དང་། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་བཞི་དང་། སངས་རྒྱས་རྗེས་སུ་དྲན་པ་དང་། ཆོས་རྗེས་སུ་དྲན་པ་དང་། དགེ་འདུན་རྗེས་སུ་དྲན་པ་དང་། ཚུལ་ཁྲིམས་རྗེས་སུ་དྲན་པ་དང་། གཏོང་བ་རྗེས་སུ་དྲན་པ་དང་།
en: You should cultivate the perceptions of the four concentrations, the four immeasurables, the four formless attainments, the recollection of the Buddha, the recollection of the Dharma, the recollection of the Saṅgha, the recollection of discipline, the recollection of generosity, the recollection of world weariness, the recollection of tranquility, the recollection of the movement of the breath, and the recollection of special insight.

source: སྐྱོ་བ་རྗེས་སུ་དྲན་པ་དང་། ཞི་གནས་རྗེས་སུ་དྲན་པ་དང་། དབུགས་རྒྱུ་བ་རྗེས་སུ་དྲན་པ་དང་།
en: Through those perceptions, you will attain the level of the solitary buddhas.

source: ལྷག་མཐོང་རྗེས་སུ་དྲན་པའི་འདུ་ཤེས་འདི་བསྒོམ་པར་བྱའོ། །གང་གིས་རང་སངས་རྒྱས་ཀྱིས་རྗེས་སུ་ཐོབ་ཅིང་མིར་གྱུར་པ་ཐོབ་ནས་ཀྱང་སྦྱིན་པ་དང་། དུལ་བ་དང་། སྡོམ་པས་སེམས་ཅན་ཐམས་ཅད་ལ་བདུད་རྩིའི་རོར་འགྲོན་བྱ་བར་བྱའོ། །ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་ཡོངས་སུ་རྫོགས་པར་བྱའོ། །
en: Once you are born among humans, you should make all beings feast on the nectar of ambrosia through your generosity, self-control, and restraint, and you should master the six perfections.

source: དྲུག་གང་ཞེ་ན།
en: What are those six perfections?

source: སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཡོངས་སུ་རྫོགས་པ་ནས། ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་བར་དུ་ཡོངས་སུ་རྫོགས་ལ།
en: You should master the perfections of generosity up to the perfection of insight.

source: བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་སངས་རྒྱས་ནས་རྣམ་པ་དེ་ལྟ་བུའི་སྒྲ་སྐད་དང་། དབྱངས་བརྗོད་པས་སེམས་ཅན་ཐམས་ཅད་ལ་དགེ་བའི་བཤེས་གཉེན་དུ་འདི་ལྟ་སྟེ། ད་ལྟར་གྱི་བཞིན་དུ་བདེ་བ་སྦྱིན་པར་འགྱུར་རོ། །
en: Once you have awakened to unsurpassed and perfect buddhahood, you will then act as virtuous friends for all beings by speaking in their languages and dialects, and you will bring them happiness as I am doing now.”

source: དེ་ནས་སེམས་ཅན་དེ་དག་འདི་སྙམ་དུ་སེམས་ཏེ། བདག་ཅག་རྣམས་ནི་གོར་མ་ཆག་པར་སྙིང་རྗེ་ཆེན་པོ་དང་ལྡན་པའི་དགེ་བའི་སྤོབས་པ་མཐོང་ངོ་སྙམ་མོ། །
en: Those beings then thought, “We are definitely witnessing the virtuous eloquence of someone endowed with great compassion!”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་སེམས་ཅན་དེ་དག་གི་སེམས་ཀྱི་རྣམ་པར་རྟོག་པ་ཐུགས་ཀྱིས་མཁྱེན་ནས་དེའི་ཚེ་དཔའ་བར་འགྲོ་བ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་ལ་སྙོམས་པར་ཞུགས་ནས།
en: The Blessed One knew the thought that had arisen in the minds of those beings. In that instant, he entered the absorption known as proceeding as a hero.

source: ཏིང་ངེ་འཛིན་དེས་ཕྱོགས་བཅུའི་ཆུ་ཀླུང་གང་གཱའི་བྱེ་མ་དང་མཉམ་པ་སྟོང་པར་གྱུར་པའི་རྙོག་པ་ལྔའི་སེམས་ཅན་གྱི་ཁམས་ཇི་སྙེད་པ་དེ་སྙེད་དུ་སྤྲུལ་པའི་ཕྱིར་སེམས་ཅན་ཚངས་པ་ལ་མོས་པ་དེ་དག་གི་མདུན་དུ་ནི་ཚངས་པའི་གཟུགས་སུ་སོ་སོར་གནས་ཤིང་ཆོས་སྟོན་ཏོ། །
en: He used that absorption to send forth emanations to all of the realms empty of a buddha, where beings are inundated with afflictions, that there are throughout the ten directions and which are as numerous as all of the grains of sand in the Ganges. He stood in the form of Brahmā before each of those beings who were devoted to Brahmā, and taught the Dharma.

source: ལ་ལ་དག་ནི་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཡང་དག་པར་ལེན་དུ་འཛུད་ལ་འཇུག་པར་བྱེད་ཅིང་སོ་སོར་འགོད་དོ། །
en: He led some of them to adopt the path of unsurpassed and perfect awakening and established them on it.

source: སེམས་ཅན་ལ་ལ་དག་ནི་རང་སངས་རྒྱས་ཀྱི་ཐེག་པ་ལའོ། །ལ་ལ་དག་ནི་ཉན་ཐོས་ཀྱི་ཐེག་པ་ལའོ། །
en: He established other beings in the vehicle of the solitary buddhas, and others in the vehicle of the hearers.

source: ལ་ལ་དག་ནི་དགེ་བའི་ལས་ཀྱི་ལམ་ལ་སྦྱོར་བས་ལྷ་དང་མི་རྣམས་ཀྱི་ཕྱིར་རོ། །
en: Some of them practiced the path of virtuous actions so that they would be born among gods and humans.

source: གང་དབང་ཕྱུག་ལ་མོས་པ་ནས། གླང་པོ་ལ་གླང་པོའི་གཟུགས་ཀྱི་བར་དང་། རྟ་ལ་རྟའི་གཟུགས་དང་། ཡི་དྭགས་ལ་ཡི་དྭགས་ཀྱི་གཟུགས་དང་། སེམས་ཅན་དམྱལ་བ་པ་ལ་སེམས་ཅན་དམྱལ་བ་པའི་གཟུགས་ཀྱིས་དེ་དག་གི་མདུན་དུ་འདུག་སྟེ་ཆོས་སྟོན་ཏོ། །
en: He taught the Dharma in front of those who were devoted to Īśvara and to elephants, horses, pretas, and hell beings while assuming the physical appearances of Īśvara, an elephant, a horse, a preta, and a hell being.

source: སེམས་ཅན་དམྱལ་བ་པའི་སེམས་ཅན་ལ་ལ་དག་ནི་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཡང་དག་པར་འཛིན་དུ་འཇུག་པ་ནས་ལྷ་དང་མིའི་བར་དག་ལ་ཡང་སྦྱོར་ཏེ།
en: Some of those hell beings were led to direct their thoughts toward unsurpassed and perfect awakening and some practiced the path leading to rebirth among gods and humans.

source: སེམས་ཅན་གང་དག་དེར་སྔོན་དགེ་བའི་རྩ་བ་འདི་དག་བསྐྱེད་པ་དེ་དག་ནི་དེ་བས་ཀྱང་བརྟན་པར་བྱས་སོ། །སེམས་ཅན་གང་དག་སྔོན་དགེ་བའི་རྩ་བ་མ་བསྐྱེད་པ་རྣམས་ནི་དེར་བསྐྱེད་དོ། །
en: Those who had created roots of virtue in the past made them become more stable, and those who had not created roots of virtue in the past created them.

source: སེམས་ཅན་གང་དད་པའི་རྒྱུ་དེས་ངན་སོང་གསུམ་པོ་དེ་དག་ལས་ཤི་འཕོས་ནས་ལྷ་དང་མིར་སྐྱེས་པ་དེའི་ཚེ་དེའི་དུས་ན།
en: Because of their faith, beings in the three lower realms were reborn among gods and humans after they died.
